{
	"personalInfo": {
		"name": "Damien Aries",
		"email": "damien.aries@gmail.com",
		"website": "www.damienaries.com",
		"linkedin": "linkedin.com/in/damien-aries",
		"github": "github.com/damienaries",
		"title": "Full Stack Developer | Next.js, Vue, React, Laravel",
		"summary": "Experienced Full Stack developer with a strong background in Vue, React and Laravel. Proven ability to translate and develop designs into beautiful, high-performance, scalable web applications."
	},
	"experience": [
		{
			"company": "iVisa.com",
			"position": "Web Developer",
			"period": "November 2021 - Present",
			"description": "Remote role at a SaaS travel e-commerce startup, working with a Laravel stack (JavaScript, TypeScript, Vue3, Vuex, TailwindCSS, PHP, Docker, MySQL).",
			"highlights": [
				"Designed and delivered new features in close collaboration with Product and Design teams, using an in-house A/B testing framework to run experiments and optimize conversion rates.",
				"Refactored and rebuilt the TailwindCSS layer for a major rebrand, translating Figma wireframes into pixel-perfect, responsive components.",
				"Improved Core Web Vitals and SEO performance through technical optimizations, contributing to a 25% YoY increase in organic search traffic.",
				"Conducted accessibility (WCAG) and performance audits to enhance user journeys and ensure compliance.",
				"Maintained high-quality code with peer reviews, unit and end-to-end testing (Pest, Jest, Laravel Dusk).",
				"Reduced technical debt by auditing legacy code, writing tooling to identify unused assets, and optimizing application performance.",
				"Worked in an Agile environment with cross-functional teams to prioritize and deliver features efficiently.",
				"Incorporated AI-powered developer tools including GitHub Copilot, Cursor IDE, and CodeRabbit to accelerate development and improve code quality."
			]
		},
		{
			"company": "Freelance Developer",
			"position": "Freelance Developer",
			"period": "March 2022 - October 2023",
			"description": "Focused on delivering high-quality web solutions with modern JavaScript frameworks, conversion optimization, and responsive design. Applied A/B testing principles, rapid prototyping, and close client collaboration to deliver features aligned with business goals.",
			"projects": [
				{
					"name": "JudiBoisson.com",
					"description": "Led the complete migration of an outdated Magento 1 site to Shopify, managing data transfer, domain setup, and new storefront design. Improved conversion rates and elevated the user experience, resulting in over $30k in sales in the first month."
				},
				{
					"name": "CareyCorea.art",
					"description": "Built a mobile-first, accessible portfolio site using Vue3, TypeScript, TailwindCSS, and Sanity CMS, emphasizing responsive design and SEO optimization."
				},
				{
					"name": "CoreaCreative.com",
					"description": "Developed a multi-page, performant video portfolio using Next.js, React, and CSS Modules, with seamless API integration (Vimeo, YouTube), optimizing Core Web Vitals and ensuring an engaging user journey."
				}
			]
		},
		{
			"company": "CONCEPT.APP",
			"position": "Full Stack Developer",
			"period": "January 2021 - July 2021",
			"description": "Early hire at an early-stage startup building a social platform with JavaScript, React, and Firebase. Front-end focused role with full-stack collaboration.",
			"highlights": [
				"Designed and built foundational UI features with React Hooks, prioritizing accessibility and responsive layouts for an improved user journey.",
				"Implemented a notification system using Websockets and Redux to support real-time user engagement.",
				"Collaborated on system design, database modeling, and Agile story organization in ClickUp to support rapid prototyping and iterative development.",
				"Worked closely with cross-functional teams to refine requirements and deliver production-ready features.",
				"Emphasized maintainable code practices with code reviews and modern JavaScript tooling (NPM, Webpack, Eslint)."
			]
		}
	],
	"education": [
		{
			"institution": "FrontEnd Masters",
			"program": "Path to senior developer",
			"completionDate": "Feb 2025"
		},
		{
			"institution": "Udemy",
			"program": "Web Development Bootcamp",
			"completionDate": "2020"
		},
		{
			"institution": "Udemy",
			"program": "React Developer Bootcamp",
			"completionDate": "2020"
		},
		{
			"institution": "University of Nantes, France",
			"program": "Bachelor of Translation and interpreting - English and Italian"
		}
	],
	"expertise": {
		"coreSkills": [
			{
				"group": "Languages & Frameworks",
				"skills": [
					"JavaScript",
					"TypeScript",
					"PHP",
					"React",
					"Next.js",
					"Vue",
					"Laravel"
				]
			},
			{
				"group": "State Management",
				"skills": ["VueX", "Redux"]
			},
			{
				"group": "Styling",
				"skills": [
					"CSS",
					"Tailwind CSS",
					"SCSS",
					"Material UI",
					"Styled Components"
				]
			},
			{
				"group": "Tooling",
				"skills": [
					"Vite",
					"Webpack",
					"Jest",
					"Pest",
					"Laravel Dusk",
					"Git",
					"Docker"
				]
			},
			{
				"group": "Backend & APIs",
				"skills": ["RESTful API development", "MySQL", "Firebase"]
			},
			{
				"group": "Quality & Practices",
				"skills": [
					"Unit & Integration Testing",
					"A/B Testing",
					"SEO",
					"Accessibility",
					"Web Vitals"
				]
			},
			{
				"group": "AI Native Development",
				"skills": ["GitHub Copilot", "Cursor IDE", "CodeRabbit"]
			},
			{
				"group": "Collaboration",
				"skills": ["Agile Development", "Async remote cross-functional teams"]
			},
			{
				"group": "Human Languages",
				"skills": [
					"French (native)",
					"English (fluent)",
					"Italian & Spanish (conversational)"
				]
			}
		]
	}
}
